In [13]:
import pandas as pd

In [14]:
df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [15]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [16]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [17]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [18]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [19]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [20]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [21]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [22]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [23]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [24]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [25]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [26]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [27]:
model.score(X_test,y_test)

0.7910447761194029

In [28]:
X_test[0:10]

     Pclass        Age     Fare  female
865       2  42.000000  13.0000       1
601       3  29.699118   7.8958       0
489       3   9.000000  15.9000       0
579       3  32.000000   7.9250       0
302       3  19.000000   0.0000       0
240       3  29.699118  14.4542       1
100       3  28.000000   7.8958       1
646       3  19.000000   7.8958       0
76        3  29.699118   7.8958       0
576       2  34.000000  13.0000       1

In [29]:
y_test[0:10]

865    1
601    0
489    1
579    1
302    0
240    0
100    0
646    0
76     0
576    1
Name: Survived, dtype: int64

In [30]:
model.predict(X_test[0:10])

array([1, 0, 0, 0, 0, 0, 0, 0, 0, 1])

In [31]:
model.predict_proba(X_test[:10])

array([[0.34861761, 0.65138239],
       [0.97054149, 0.02945851],
       [0.95157351, 0.04842649],
       [0.97114304, 0.02885696],
       [0.96131592, 0.03868408],
       [0.53173094, 0.46826906],
       [0.52016788, 0.47983212],
       [0.96420863, 0.03579137],
       [0.97054149, 0.02945851],
       [0.35130816, 0.64869184]])

In [32]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.688     , 0.776     , 0.76      , 0.7983871 , 0.75806452])